app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(class_params(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Data Science"], ["room_number", 33]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(class_params(:title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Software Engineering"], ["id", 2]]