app/controllers/students_controller.rb

  def update
    @student=Student.find(params[:id])
    @student.update(strong_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Persaud"], ["updated_at", "2020-02-29 16:09:14.356561"], ["id", 12]]

  def create
    @student=Student.new(strong_params)
    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Buddy"], ["last_name", "Bud"], ["created_at", "2020-02-29 16:17:34.323560"], ["updated_at", "2020-02-29 16:17:34.323560"]]